Public Member Functions | Friends | List of all members
ACAPI::LicenseInfo::LicenseInfoManager Class Reference
LicenseInfo
LicenseInfoManager is the entry point of the license or product-related informations. More...
#include <LicenseInfoManager.hpp>
 Inheritance diagram for ACAPI::LicenseInfo::LicenseInfoManager:
 Public Member Functions
ProductVersionInfo  | GetProductVersionInfo () const
Returns an instance of ProductVersionInfo.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< LicenseInfoManager >  | GetLicenseInfoManager ()
Creates a LicenseInfoManager instance.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
LicenseInfoManager is the entry point of the license or product-related informations.
Since
Archicad 28
Friends And Related Symbol Documentation
◆ GetLicenseInfoManager
 Result< LicenseInfoManager > GetLicenseInfoManager  |  ( |   | )
friend
Creates a LicenseInfoManager instance.
Returns
The new LicenseInfoManager instance.
Remarks
This is the entry point of the license information on the API.